RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/tamper_reg.h
/**************************************************************************//**
 * @file     tamper_reg.h
 * @version  V1.00
 * @brief    Tamper register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __TAMPER_REG_H__
#define __TAMPER_REG_H__

/** @addtogroup REGISTER Control Register

  @{

*/


/*---------------------------- Tamper Controller ----------------------------*/
/**
    @addtogroup Tamper Controller(TAMPER)
    Memory Mapped Structure for Tamper Controller
  @{
*/

typedef struct
{


    /**
     * @var TAMPER_T::INIT
     * Offset: 0x00  Tamper Function Initiation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TCORERST  |Tamper Core Reset
     * |        |          |0 = Write 0x5500; the Tamper core block reset will be released.
     * |        |          |1 = Write 0x55AA; the Tamper core block will be reset.
     * |[31]    |TLDORDY   |Voltage Regulator Power Ready (Read Only)
     * |        |          |0 = The power status of voltage regulator is not ready.
     * |        |          |1 = The power status of voltage regulator is ready.
     * @var TAMPER_T::FUNEN
     * Offset: 0x04  Tamper Block Function Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LXTDETEN  |LXT Clock Detection Enable Bit
     * |        |          |0 = Write 0x40; the LXT clock detection Disabled.
     * |        |          |1 = Write 0x44; the LXT clock detection Enabled.
     * |[13:8]  |TMPIOSEL  |Tamper I/O Detection Selection Bit
     * |        |          |0 = Write 0x90/0xA0/0xB0/0xC0/0xD0/0xE0 for tamper I/O 0~5; the I/O tamper function is detected through RTC block.
     * |        |          |1 = Write 0x94/0xA4/0xB4/0xC4/0xD4/0xE4 for tamper I/O 0~5; the I/O tamper function is detected through Tamper block.
     * |[23:16] |HIRC48MEN |HIRC48M Enable Bit
     * |        |          |The HIRC48M is disabled when these bits equal 0x5A, otherwise it will be enabled with any other values.
     * |[24]    |VGCHEN0   |Voltage Glitch Channel 0 Enable Bit
     * |        |          |0 = Voltage glitch channel 0 Disabled.
     * |        |          |1 = Voltage glitch channel 0 Enabled.
     * |        |          |Note: To avoid the voltage glitch when the voltage channel is enabled, it is better to detect the voltage glitch about 150us after the channel is enabled.
     * |[25]    |VGCHEN1   |Voltage Glitch Channel 1 Enable Bit
     * |        |          |0 = Voltage glitch channel 1 Disabled.
     * |        |          |1 = Voltage glitch channel 1 Enabled.
     * |        |          |Note: To avoid the voltage glitch when the voltage channel is enabled, it is better to detect the voltage glitch about 150us after the channel is enabled.
     * |[26]    |VGCHEN2   |Voltage Glitch Channel 2 Enable Bit
     * |        |          |0 = Voltage glitch channel 2 Disabled.
     * |        |          |1 = Voltage glitch channel 2 Enabled.
     * |        |          |Note: To avoid the voltage glitch when the voltage channel is enabled, it is better to detect the voltage glitch about 150us after the channel is enabled.
     * |[27]    |VGCHEN3   |Voltage Glitch Channel 3 Enable Bit
     * |        |          |0 = Voltage glitch channel 3 Disabled.
     * |        |          |1 = Voltage glitch channel 3 Enabled.
     * |        |          |Note: To avoid the voltage glitch when the voltage channel is enabled, it is better to detect the voltage glitch about 150us after the channel is enabled.
     * @var TAMPER_T::TRIEN
     * Offset: 0x08  Tamper Trigger Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |KSTRIGEN  |Key Store Trigger Enable Bit
     * |        |          |0 = Tamper event is detected and to trigger Key Store Disabled.
     * |        |          |1 = Tamper event is detected and to trigger Key Store Enabled.
     * |[2]     |WAKEUPEN  |Wakeup Enable Bit
     * |        |          |0 = Tamper wakeup event Disabled.
     * |        |          |1 = Tamper wakeup event Enabled.
     * |[3]     |CRYPTOEN  |Crypto Enable Bit
     * |        |          |0 = Tamper event clear Crypto Disabled.
     * |        |          |1 = Tamper event clear Crypto Enabled.
     * |[4]     |CHIPRSTEN |Chip Reset Enable Bit
     * |        |          |0 = Tamper event trigger chip reset Disabled.
     * |        |          |1 = Tamper event trigger chip reset Enabled.
     * |[5]     |RTCSPCLREN|RTC Spare Register Clear Enable Bit
     * |        |          |0 = Tamper event trigger RTC spare register reset Disabled.
     * |        |          |1 = Tamper event trigger RTC spare register reset Enabled.
     * @var TAMPER_T::INTEN
     * Offset: 0x0C  Tamper Event Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TAMP0IEN  |Tamper 0 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 0 event interrupt Disabled.
     * |        |          |1 = Tamper 0 event interrupt Enabled.
     * |[1]     |TAMP1IEN  |Tamper 1 or Pair 0 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 1 or Pair 0 event interrupt Disabled.
     * |        |          |1 = Tamper 1 or Pair 0 event interrupt Enabled.
     * |[2]     |TAMP2IEN  |Tamper 2 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 2 event interrupt Disabled.
     * |        |          |1 = Tamper 2 event interrupt Enabled.
     * |[3]     |TAMP3IEN  |Tamper 3 or Pair 1 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 3 or Pair 1 event interrupt Disabled.
     * |        |          |1 = Tamper 3 or Pair 1 event interrupt Enabled.
     * |[4]     |TAMP4IEN  |Tamper 4 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 4 event interrupt Disabled.
     * |        |          |1 = Tamper 4 event interrupt Enabled.
     * |[5]     |TAMP5IEN  |Tamper 5 or Pair 2 Event Interrupt Enable Bit
     * |        |          |0 = Tamper 5 or Pair 2 event interrupt Disabled.
     * |        |          |1 = Tamper 5 or Pair 2 event interrupt Enabled.
     * |[6]     |CLKFIEN   |LXT Clock Frequency Monitor Fail Event Interrupt Enable Bit
     * |        |          |0 = LXT frequency fail event interrupt Disabled.
     * |        |          |1 = LXT frequency fail event interrupt Enabled.
     * |[7]     |CLKSTOPIEN|LXT Clock Frequency Monitor Stop Event Interrupt Enable Bit
     * |        |          |0 = LXT frequency stop event interrupt Disabled.
     * |        |          |1 = LXT frequency stop event interrupt Enabled.
     * |[8]     |OVPIEN    |VDD Over Voltage Protect Detection Interrupt Enable Bit
     * |        |          |0 = Detect VDD over voltage protect detection interrupt Disabled.
     * |        |          |1 = Detect VDD over voltage protect detection interrupt Enabled.
     * |        |          |Note: The function enable of the over voltage detection is defined in system manager.
     * |[9]     |VGPIEN    |Voltage Glitch Positive Detection Event Interrupt Enable Bit
     * |        |          |0 = LDO_CAP positive glitch event interrupt Disabled.
     * |        |          |1 = LDO_CAP positive glitch event interrupt Enabled.
     * |[10]    |VGNIEN    |Voltage Glitch Negative Detection Event Interrupt Enable Bit
     * |        |          |0 = LDO_CAP negative glitch event interrupt Disabled.
     * |        |          |1 = LDO_CAP negative glitch event interrupt Enabled.
     * |[11]    |ACTSIEN   |Active Shield Event Interrupt Enable Bit
     * |        |          |0 = Active shield event interrupt Disabled.
     * |        |          |1 = Active shield event interrupt Enabled.
     * |[16]    |RTCLVRIEN |RTC Low Voltage Detection Event Interrupt Enable Bit
     * |        |          |0 = VBAT low voltage detection event interrupt Disabled.
     * |        |          |1 = VBAT low voltage detection event interrupt Enabled.
     * |[17]    |RTCIOIEN  |RTC Tamper I/O Event Interrupt Enable Bit
     * |        |          |0 = RTC tamper I/O detection event interrupt Disabled.
     * |        |          |1 = RTC tamper I/O detection event interrupt Enabled.
     * |[18]    |RTCLKIEN  |RTC Clock Monitor Detection Event Interrupt Enable Bit
     * |        |          |0 = RTC clock monitor event interrupt Disabled.
     * |        |          |1 = RTC clock monitor event interrupt Enabled.
     * |[22]    |BODIEN    |BOD Event Interrupt Enable Bit
     * |        |          |0 = Brown-out event interrupt Disabled.
     * |        |          |1 = Brown-out event interrupt Enabled.
     * @var TAMPER_T::INTSTS
     * Offset: 0x10  Tamper Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TAMP0IF   |Tamper 0 Event Interrupt Flag
     * |        |          |0 = No Tamper 0 event interrupt flag is generated.
     * |        |          |1 = Tamper 0 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[1]     |TAMP1IF   |Tamper 1 Event Interrupt Flag
     * |        |          |0 = No Tamper 1 event interrupt flag is generated.
     * |        |          |1 = Tamper 1 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[2]     |TAMP2IF   |Tamper 2 Event Interrupt Flag
     * |        |          |0 = No Tamper 2 event interrupt flag is generated.
     * |        |          |1 = Tamper 2 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[3]     |TAMP3IF   |Tamper 3 Event Interrupt Flag
     * |        |          |0 = No Tamper 3 event interrupt flag is generated.
     * |        |          |1 = Tamper 3 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[4]     |TAMP4IF   |Tamper 4 Event Interrupt Flag
     * |        |          |0 = No Tamper 4 event interrupt flag is generated.
     * |        |          |1 = Tamper 4 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[5]     |TAMP5IF   |Tamper 5 Event Interrupt Flag
     * |        |          |0 = No Tamper 5 event interrupt flag is generated.
     * |        |          |1 = Tamper 5 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[6]     |CLKFAILIF |LXT Clock Frequency Monitor Fail Event Interrupt Flag
     * |        |          |0 = LXT frequency is normal.
     * |        |          |1 = LXT frequency is abnormal.
     * |        |          |Note 1: Write 1 to clear this bit to 0.
     * |        |          |Note 2: LXT detector will be automatically disabled when Fail/Stop flag rises, and resumes after Fail/Stop flag is cleared.
     * |[7]     |CLKSTOPIF |LXT Clock Frequency Monitor Stop Event Interrupt Flag
     * |        |          |0 = LXT frequency is normal.
     * |        |          |1 = LXT frequency is almost stopped.
     * |        |          |Note 1: Write 1 to clear this bit to 0.
     * |        |          |Note 2: LXT detector will be automatically disabled when Fail/Stop flag rises, and resumes after Fail/Stop flag is cleared.
     * |[8]     |OVPOUTIF  |VDD Over Voltage Event Interrupt Flag
     * |        |          |0 = VDD no over voltage is detected.
     * |        |          |1 = VDD over voltage is detected.
     * |        |          |Note: Write 1 to clear this bit.
     * |[9]     |VGPEVIF   |Voltage Glitch Positive Detection Interrupt Flag
     * |        |          |0 = LDO_CAP positive glitch is not detected.
     * |        |          |1 = LDO_CAP positive glitch is detected.
     * |        |          |Note: It can be written 1 to clear only (No clear by TCORERST)
     * |[10]    |VGNEVIF   |Voltage Glitch Negative Detection Interrupt Flag
     * |        |          |0 = LDO_CAP negative glitch is not detected.
     * |        |          |1 = LDO_CAP negative glitch is detected.
     * |        |          |Note: It can be written 1 to clear only (No clear by TCORERST)
     * |[11]    |ACTSEIF   |Active Shield Event Detection Interrupt Flag
     * |        |          |0 = Active shield event interrupt flag is not detected.
     * |        |          |1 = Active shield event interrupt flag is detected including the voltage of voltage regulator and GND attack.
     * |        |          |Note: Write 1 to clear this bit after all of ACTSTxIF bits have been cleaned.
     * |[13]    |ACTST5IF  |Active Shield Tamper 5 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 5 event interrupt flag is generated.
     * |        |          |1 = Active shield Tamper 5 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[15]    |ACTST25IF |Active Shield Tamper 5 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 5 event interrupt flag is generated.
     * |        |          |1 = 2th Active shield Tamper 5 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[16]    |RTCLVRIF  |RTC Low Voltage Detection Event Interrupt Flag
     * |        |          |0 = VBAT low voltage detection event interrupt flag is not detected.
     * |        |          |1 = VBAT low voltage detection event interrupt flag is detected.
     * |[17]    |RIOTRIGIF |RTC Tamper I/O Event Interrupt Flag
     * |        |          |0 = There is no RTC tamper I/O detection event interrupt flag.
     * |        |          |1 = There is RTC tamper I/O detection event interrupt flag.
     * |[18]    |RCLKTRIGIF|RTC Clock Monitor Detection Event Interrupt Flag
     * |        |          |0 = There is no RTC clock monitor detection event interrupt flag.
     * |        |          |1 = There is RTC clock monitor detection event interrupt flag.
     * |[22]    |BODIF     |BOD Event Interrupt Flag
     * |        |          |0 = Brown-out event interrupt flag is no detected.
     * |        |          |1 = Brown-out interrupt flag is detected.
     * |        |          |Note: It is used to detect the LDO_CAP. Write 1 to clear this bit.
     * |[25]    |ACTST1IF  |Active Shield Tamper 1 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 1 event interrupt flag is generated.
     * |        |          |1 = Active shield Tamper 1 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[27]    |ACTST3IF  |Active Shield Tamper 3 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 3 event interrupt flag is generated.
     * |        |          |1 = Active shield Tamper 3 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[29]    |ACTST21IF |2th Active Shield Tamper 1 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 1 event interrupt flag is generated.
     * |        |          |1 = 2th Active shield Tamper 1 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * |[31]    |ACTST23IF |2th Active Shield Tamper 3 Event Interrupt Flag
     * |        |          |0 = No Active shield Tamper 3 event interrupt flag is generated.
     * |        |          |1 = 2th Active shield Tamper 3 event interrupt flag is generated.
     * |        |          |Note: Write 1 to clear this bit.
     * @var TAMPER_T::LIRCTL
     * Offset: 0x14  Tamper LIRC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:0]   |TLRCTRIM  |Tamper TLIRC32K Trim Value
     * |        |          |TLIRC32K trim value setting
     * |[10:9]  |TRIMMOS   |Tamper TLIRC32K Trim MOS Value
     * |        |          |TLIRC32K trim MOS value setting
     * @var TAMPER_T::TIOCTL
     * Offset: 0x18  Tamper I/O Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DYN1ISS   |Dynamic Pair 1 Input Source Select
     * |        |          |This bit determines Tamper 3 input is from Tamper 2 or Tamper 0 in dynamic mode.
     * |        |          |0 = Tamper input is from Tamper 2.
     * |        |          |1 = Tamper input is from Tamper 0.
     * |        |          |Note: This bit is effective only when DYNPR1EN (TAMPER_TIOCTL[23]) and DYNPR0EN (TAMPER_TIOCTL[15]) are set.
     * |[1]     |DYN2ISS   |Dynamic Pair 2 Input Source Select
     * |        |          |This bit determines Tamper 5 input is from Tamper 4 or Tamper 0 in dynamic mode.
     * |        |          |0 = Tamper input is from Tamper 4.
     * |        |          |1 = Tamper input is from Tamper 0.
     * |        |          |Note: This bit has effect only when DYNPR2EN (TAMPER_TIOCTL[31]) and DYNPR0EN (TAMPER_TIOCTL[15]) are set.
     * |[3]     |DYNSRC    |Dynamic Reference Pattern
     * |        |          |This field determines the new reference pattern when current pattern run out in dynamic pair mode.
     * |        |          |0 = The new reference pattern is generated by random number generator when the reference pattern run out.
     * |        |          |1 = The new reference pattern is repeated from SEED (TAMPER_SEED[31:0]) when the reference pattern run out.
     * |        |          |Note: After this bit is modified, the SEEDRLD (TAMPER_TIOCTL[4]) should be set.
     * |[4]     |SEEDRLD   |Reload New Seed for PRNG Engine
     * |        |          |Setting this bit, the tamper configuration will be reloaded.
     * |        |          |0 = Generating key based on the current seed.
     * |        |          |1 = Reload new seed.
     * |        |          |Note 1: Before this bit is set, the tamper configuration should be set to complete and this bit will be auto clear to 0 after reload new seed completed.
     * |        |          |Note 2: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[7:5]   |DYNRATE   |Dynamic Change Rate
     * |        |          |This item is choice the dynamic tamper output change rate.
     * |        |          |000 = 26 * RTC_CLK.
     * |        |          |001 = 27 * RTC_CLK.
     * |        |          |010 = 28 * RTC_CLK.
     * |        |          |011 = 29 * RTC_CLK.
     * |        |          |100 = 210 * RTC_CLK.
     * |        |          |101 = 211 * RTC_CLK.
     * |        |          |110 = 212 * RTC_CLK.
     * |        |          |111 = 213 * RTC_CLK.
     * |        |          |Note: After revising this field, setting SEEDRLD (TAMPER_TIOCTL[4]) can reload change rate immediately.
     * |[8]     |TAMP0EN   |Tamper0 Detect Enable Bit
     * |        |          |0 = Tamper 0 detect Disabled.
     * |        |          |1 = Tamper 0 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[9]     |TAMP0LV   |Tamper 0 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[10]    |TAMP0DBEN |Tamper 0 De-bounce Enable Bit
     * |        |          |0 = Tamper 0 de-bounce Disabled.
     * |        |          |1 = Tamper 0 de-bounce Enabled. Tamper detection pin will sync 1 RTC clock.
     * |[12]    |TAMP1EN   |Tamper 1 Detect Enable Bit
     * |        |          |0 = Tamper 1 detect Disabled.
     * |        |          |1 = Tamper 1 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[13]    |TAMP1LV   |Tamper 1 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[14]    |TAMP1DBEN |Tamper 1 De-bounce Enable Bit
     * |        |          |0 = Tamper 1 de-bounce Disabled.
     * |        |          |1 = Tamper 1 de-bounce Enabled, tamper detection pin will sync 1 RTC clock.
     * |[15]    |DYNPR0EN  |Dynamic Pair 0 Enable Bit
     * |        |          |0 = Static detect.
     * |        |          |1 = Dynamic detect.
     * |[16]    |TAMP2EN   |Tamper 2 Detect Enable Bit
     * |        |          |0 = Tamper 2 detect Disabled.
     * |        |          |1 = Tamper 2 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector need sync 2 ~ 3 RTC-clock.
     * |[17]    |TAMP2LV   |Tamper 2 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[18]    |TAMP2DBEN |Tamper 2 De-bounce Enable Bit
     * |        |          |0 = Tamper 2 de-bounce Disabled.
     * |        |          |1 = Tamper 2 de-bounce Enabled. Tamper detection pin will sync 1 RTC clock.
     * |[20]    |TAMP3EN   |Tamper 3 Detect Enable Bit
     * |        |          |0 = Tamper 3 detect Disabled.
     * |        |          |1 = Tamper 3 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[21]    |TAMP3LV   |Tamper 3 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[22]    |TAMP3DBEN |Tamper 3 De-bounce Enable Bit
     * |        |          |0 = Tamper 3 de-bounce Disabled.
     * |        |          |1 = Tamper 3 de-bounce Enabled. Tamper detection pin will sync 1 RTC clock.
     * |[23]    |DYNPR1EN  |Dynamic Pair 1 Enable Bit
     * |        |          |0 = Static detect.
     * |        |          |1 = Dynamic detect.
     * |[24]    |TAMP4EN   |Tamper4 Detect Enable Bit
     * |        |          |0 = Tamper 4 detect Disabled.
     * |        |          |1 = Tamper 4 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[25]    |TAMP4LV   |Tamper 4 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[26]    |TAMP4DBEN |Tamper 4 De-bounce Enable Bit
     * |        |          |0 = Tamper 4 de-bounce Disabled.
     * |        |          |1 = Tamper 4 de-bounce Enabled. Tamper detection pin will sync 1 RTC clock.
     * |[28]    |TAMP5EN   |Tamper 5 Detect Enable Bit
     * |        |          |0 = Tamper 5 detect Disabled.
