RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/tamper_reg.h
     * |        |          |1 = Tamper 5 detect Enabled.
     * |        |          |Note: The reference is RTC-clock. Tamper detector needs sync 2 ~ 3 RTC-clock.
     * |[29]    |TAMP5LV   |Tamper 5 Level
     * |        |          |This bit depends on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[30]    |TAMP5DBEN |Tamper 5 De-bounce Enable Bit
     * |        |          |0 = Tamper 5 de-bounce Disabled.
     * |        |          |1 = Tamper 5 de-bounce Enabled. Tamper detection pin will sync 1 RTC clock.
     * |[31]    |DYNPR2EN  |Dynamic Pair 2 Enable Bit
     * |        |          |0 = Static detect.
     * |        |          |1 = Dynamic detect.
     * @var TAMPER_T::SEED
     * Offset: 0x1C  Tamper Seed Value Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |SEED      |Seed value.
     * @var TAMPER_T::SEED2
     * Offset: 0x20  Tamper 2nd Seed Value Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |SEED2     |Seed value. These seed value are used for 2nd active shield I/O.
     * @var TAMPER_T::ACTSTIOCTL1
     * Offset: 0x24  Tamper Active Shield Tamper I/O Function Control Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADYN1ISS  |Active Shied Dynamic Pair 1 Input Source Select
     * |        |          |This bit determines Tamper 3 input is from Tamper 2 or Tamper 0 in dynamic mode.
     * |        |          |0 = Tamper input is from Tamper 2.
     * |        |          |1 = Tamper input is from Tamper 0.
     * |        |          |Note: This bit is effective only when ADYNPR1EN (TAMPER_ACTSTIOCTL1[23]) and ADYNPR0EN (TAMPER_ACTSTIOCTL1[15]) are set.
     * |[3]     |ADYNSRC   |Active Shied Dynamic Reference Pattern
     * |        |          |This field determines the new reference pattern when current pattern run out in dynamic pair mode.
     * |        |          |0 = The new reference pattern is generated by random number generator when the reference pattern run out.
     * |        |          |1 = The new reference pattern is repeated from SEED (TAMPER_SEED[31:0]) when the reference pattern run out.
     * |        |          |Note: After this bit is modified, the SEEDRLD (TAMPER_TIOCTL[4]) should be set.
     * |[7:5]   |ADYNRATE  |Active Shied Dynamic Change Rate
     * |        |          |Use the bits to choose the dynamic tamper output change rate.
     * |        |          |000 = 210 * TLIRC32K.
     * |        |          |001 = 211 * TLIRC32K.
     * |        |          |010 = 212 * TLIRC32K.
     * |        |          |011 = 213 * TLIRC32K.
     * |        |          |100 = 214 * TLIRC32K.
     * |        |          |101 = 215 * TLIRC32K.
     * |        |          |110 = 216 * TLIRC32K.
     * |        |          |111 = 217 * TLIRC32K.
     * |        |          |Note: After this field is modified, setting SEEDRLD (TAMPER_TIOCTL[4]) can reload the change rate immediately.
     * |[8]     |ATAMP0EN  |Active Shied Tamper0 Detect Enable Bit
     * |        |          |0 = Tamper 0 detect Disabled.
     * |        |          |1 = Tamper 0 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.
     * |[12]    |ATAMP1EN  |Active Shied Tamper 1 Detect Enable Bit
     * |        |          |0 = Tamper 1 detect Disabled.
     * |        |          |1 = Tamper 1 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[15]    |ADYNPR0EN |Active Shied Dynamic Pair 0 Enable Bit
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * |[16]    |ATAMP2EN  |Active Shied Tamper 2 Detect Enable Bit
     * |        |          |0 = Tamper 2 detect Disabled.
     * |        |          |1 = Tamper 2 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[20]    |ATAMP3EN  |Active Shied Tamper 3 Detect Enable Bit
     * |        |          |0 = Tamper 3 detect Disabled.
     * |        |          |1 = Tamper 3 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[23]    |ADYNPR1EN |Active Shied Dynamic Pair 1 Enable Bit
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * |[24]    |ATAMP4EN  |Active Tamper4 Detect Enable Bit
     * |        |          |0 = Tamper 4 detect Disabled.
     * |        |          |1 = Tamper 4 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.
     * |[28]    |ATAMP5EN  |Active Tamper 5 Detect Enable Bit
     * |        |          |0 = Tamper 5 detect Disabled.
     * |        |          |1 = Tamper 5 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.
     * |[31]    |ADYNPR2EN |Active Shied Dynamic Pair 2 Enable Bit
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * @var TAMPER_T::ACTSTIOCTL2
     * Offset: 0x28  Tamper Active Shield Tamper I/O Function Control Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADYN1ISS2 |Active Shied Dynamic Pair 1 Input Source Select 2
     * |        |          |This bit determines if Tamper 3 input is from Tamper 2 or Tamper 0 in dynamic mode.
     * |        |          |0 = Tamper input is from Tamper 2.
     * |        |          |1 = Tamper input is from Tamper 0.
     * |        |          |Note: This bit is effective only when ADYNPR1EN2 (TAMPER_ACTSTIOCTL2[23]) and ADYNPR0EN2 (TAMPER_ACTSTIOCTL2[15]) are set.
     * |[3]     |ADYNSRC2  |Active Shied Dynamic Reference Pattern 2
     * |        |          |This field determines the new reference pattern when current pattern run out in dynamic pair mode.
     * |        |          |0 = The new reference pattern is generated by random number generator when the reference pattern run out.
     * |        |          |1 = The new reference pattern is repeated from SEED2 (TAMPER_SEED2[31:0]) when the reference pattern run out.
     * |        |          |Note: After this bit is modified, the SEEDRLD2 (TAMPER_ACTSTIOCTL2[4]) should be set.
     * |[4]     |SEEDRLD2  |Reload New Seed for PRNG Engine 2
     * |        |          |Setting this bit, the tamper configuration will be reloaded.
     * |        |          |0 = Generating key based on the current seed.
     * |        |          |1 = Reload new seed.
     * |        |          |Note 1: Before this bit is set, the tamper configuration should be set to complete and this bit will be auto clear to 0 after reload new seed completed.
     * |        |          |Note 2: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[7:5]   |ADYNRATE2 |Active Shied Dynamic Change Rate 2
     * |        |          |Use the bits to choose the dynamic tamper output change rate.
     * |        |          |000 = 210 * TLIRC32K.
     * |        |          |001 = 211 * TLIRC32K.
     * |        |          |010 = 212 * TLIRC32K.
     * |        |          |011 = 213 * TLIRC32K.
     * |        |          |100 = 214 * TLIRC32K.
     * |        |          |101 = 215 * TLIRC32K.
     * |        |          |110 = 216 * TLIRC32K.
     * |        |          |111 = 217 * TLIRC32K.
     * |        |          |Note: After this field is modified, setting SEEDRLD2 (TAMPER_ACTSTIOCTL2[4]) can reload change rate immediately.
     * |[8]     |ATAMP0EN2 |Active Shied Tamper0 Detect Enable Bit 2
     * |        |          |0 = Tamper 0 detect Disabled.
     * |        |          |1 = Tamper 0 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[12]    |ATAMP1EN2 |Active Shied Tamper 1 Detect Enable Bit 2
     * |        |          |0 = Tamper 1 detect Disabled.
     * |        |          |1 = Tamper 1 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[15]    |ADYNPR0EN2|Active Shied Dynamic Pair 0 Enable Bit 2
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * |[16]    |ATAMP2EN2 |Active Shied Tamper 2 Detect Enable Bit 2
     * |        |          |0 = Tamper 2 detect Disabled.
     * |        |          |1 = Tamper 2 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[20]    |ATAMP3EN2 |Active Shied Tamper 3 Detect Enable Bit 2
     * |        |          |0 = Tamper 3 detect Disabled.
     * |        |          |1 = Tamper 3 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.
     * |[23]    |ADYNPR1EN2|Active Shied Dynamic Pair 1 Enable Bit 2
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * |[24]    |ATAMP4EN2 |Active Shied Tamper4 Detect Enable Bit 2
     * |        |          |0 = Tamper 4 detect Disabled.
     * |        |          |1 = Tamper 4 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.
     * |[28]    |ATAMP5EN2 |Active Tamper 5 Detect Enable Bit 2
     * |        |          |0 = Tamper 5 detect Disabled.
     * |        |          |1 = Tamper 5 detect Enabled.
     * |        |          |Note: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.
     * |[31]    |ADYNPR2EN2|Active Shied Dynamic Pair 2 Enable Bit 2
     * |        |          |0 = Static detect (Not supported).
     * |        |          |1 = Dynamic detect.
     * @var TAMPER_T::CDBR
     * Offset: 0x2C  Tamper Clock Frequency Detector Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |STOPBD    |LXT Clock Frequency Detector Stop Boundary
     * |        |          |The bits define the stop value of frequency monitor window.
     * |        |          |When LXT frequency monitor counter lower than Clock Frequency Detector Stop Boundary, the LXT frequency detect stop interrupt flag will set to 1.
     * |        |          |Note: The boundary is defined as the maximum value of LXT among 256 Tamper clock time.
     * |[23:16] |FAILBD    |LXT Clock Frequency Detector Fail Boundary
     * |        |          |The bits define the fail value of frequency monitor window.
     * |        |          |When LXT frequency monitor counter lower than Clock Frequency Detector Fail Boundary, the LXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Note: The boundary is defined as the minimum value of LXT among 256 Tamper clock time.
     * @var TAMPER_T::VG
     * Offset: 0x30  Tamper Voltage Glitch Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PCLKSEL0  |PL0 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL0 means the power level is 1.26V
     * |        |          |The power level is controlled in system manager
     * |[7:4]   |NCLKSEL0  |PL0 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[11:8]  |PDATSEL0  |PL0 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[15:12] |NDATSEL0  |PL0 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[19:16] |PCLKSEL1  |PL1 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL1 means the power level is 1.2V
     * |[23:20] |NCLKSEL1  |PL1 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[27:24] |PDATSEL1  |PL1 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[31:28] |NDATSEL1  |PL1 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * @var TAMPER_T::VGEV
     * Offset: 0x34  Tamper Voltage Glitch Event Tolerance Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |VGECNTP   |Positive Voltage Glitch Error Tolerance
     * |        |          |The value indicates the tolerance count for positive voltage glitch event.
     * |[15:8]  |VGECNTN   |Negative Voltage Glitch Error Tolerance
     * |        |          |The value indicates the tolerance count for negative voltage glitch event.
     * @var TAMPER_T::LDOTRIM
     * Offset: 0x38  Tamper LDO Trim Value Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |TLDOTRIM  |Voltage Regulator Output Voltage Trim
     * |        |          |The value indicates the trim value of the voltage regulator output voltage.
     * |[9:8]   |TLDOIQSEL |Voltage Regulator Qu Current Selection
     * |        |          |Indicates the Qu current selection of voltage regulator.
     * @var TAMPER_T::LBSTRIM
     * Offset: 0x3C  Tamper LDO BIAS Trim Value Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TLVDSEL   |Under-shoot Detect Level Trim Bits
     * |        |          |The value indicates the trim value of the under-shoot detection level
     * |[4]     |TOVDSEL   |Over-shoot Detect Level Trim Bits
     * |        |          |The value indicates the trim value of the over-shoot detection level
     * |[9:8]   |BSCMPLV   |Under-shoot Detect Comparator Current Trim Bits
     * |        |          |The value indicates the trim value of the under-shoot detection comparator current trim level
     * |[11:10] |BSCMPOV   |Over-shoot Detect Comparator Current Trim Bits
     * |        |          |The value indicates the trim value of the over-shoot detection comparator current trim level
     * |[13:12] |HYSCMPLV  |Under-shoot Detect Comparator Hysteresis Trim Bits
     * |        |          |The value indicates the trim value of the under-shoot detection comparator of hysteresis trim level
     * |[15:14] |HYSCMPOV  |Over-shoot Detect Comparator Hysteresis Trim Bits
     * |        |          |The value indicates the trim value of the over-shoot detection comparator of hysteresis trim level
     * @var TAMPER_T::VG2
     * Offset: 0x40  Tamper Voltage Glitch Control Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PCLKSEL2  |PL2 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL2 means the power level is 1.1V
     * |        |          |The power level is controlled in system manager.
     * |[7:4]   |NCLKSEL2  |PL2 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[11:8]  |PDATSEL2  |PL2 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[15:12] |NDATSEL2  |PL2 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[19:16] |PCLKSEL3  |PL3 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL3 means the power level is 0.9V
     * |[23:20] |NCLKSEL3  |PL3 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[27:24] |PDATSEL3  |PL3 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[31:28] |NDATSEL3  |PL3 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     */
    __IO uint32_t INIT;                  /*!< [0x0000] Tamper Function Initiation Register                              */
    __IO uint32_t FUNEN;                 /*!< [0x0004] Tamper Block Function Enable Register                            */
    __IO uint32_t TRIEN;                 /*!< [0x0008] Tamper Trigger Enable Register                                   */
    __IO uint32_t INTEN;                 /*!< [0x000c] Tamper Event Interrupt Enable Register                           */
    __IO uint32_t INTSTS;                /*!< [0x0010] Tamper Interrupt Status Register                                 */
    __IO uint32_t LIRCTL;                /*!< [0x0014] Tamper LIRC Control Register                                     */
    __IO uint32_t TIOCTL;                /*!< [0x0018] Tamper I/O Function Control Register                             */
    __IO uint32_t SEED;                  /*!< [0x001c] Tamper Seed Value Control Register                               */
    __IO uint32_t SEED2;                 /*!< [0x0020] Tamper 2nd Seed Value Control Register                           */
    __IO uint32_t ACTSTIOCTL1;           /*!< [0x0024] Tamper Active Shield Tamper I/O Function Control Register 1      */
    __IO uint32_t ACTSTIOCTL2;           /*!< [0x0028] Tamper Active Shield Tamper I/O Function Control Register 2      */
    __IO uint32_t CDBR;                  /*!< [0x002c] Tamper Clock Frequency Detector Boundary Register                */
    __IO uint32_t VG;                    /*!< [0x0030] Tamper Voltage Glitch Control Register                           */
    __IO uint32_t VGEV;                  /*!< [0x0034] Tamper Voltage Glitch Event Tolerance Control Register           */
    __IO uint32_t LDOTRIM;               /*!< [0x0038] Tamper LDO Trim Value Control Register                           */
    __IO uint32_t LBSTRIM;               /*!< [0x003c] Tamper LDO BIAS Trim Value Control Register                      */
    __IO uint32_t VG2;                   /*!< [0x0040] Tamper Voltage Glitch Control Register 2                         */

} TAMPER_T;

/**
    @addtogroup TAMPER_CONST Tamper Bit Field Definition
    Constant Definitions for Tamper Controller
  @{
*/

#define TAMPER_INIT_TCORERST_Pos         (0)                                               /*!< TAMPER_T::INIT: TCORERST Position      */
#define TAMPER_INIT_TCORERST_Msk         (0x1ul << TAMPER_INIT_TCORERST_Pos)               /*!< TAMPER_T::INIT: TCORERST Mask          */

#define TAMPER_INIT_TLDORDY_Pos          (31)                                              /*!< TAMPER_T::INIT: TLDORDY Position       */
#define TAMPER_INIT_TLDORDY_Msk          (0x1ul << TAMPER_INIT_TLDORDY_Pos)                /*!< TAMPER_T::INIT: TLDORDY Mask           */

#define TAMPER_FUNEN_LXTDETEN_Pos        (0)                                               /*!< TAMPER_T::FUNEN: LXTDETEN Position     */
#define TAMPER_FUNEN_LXTDETEN_Msk        (0x1ul << TAMPER_FUNEN_LXTDETEN_Pos)              /*!< TAMPER_T::FUNEN: LXTDETEN Mask         */

#define TAMPER_FUNEN_TMPIOSEL_Pos        (8)                                               /*!< TAMPER_T::FUNEN: TMPIOSEL Position     */
#define TAMPER_FUNEN_TMPIOSEL_Msk        (0x3ful << TAMPER_FUNEN_TMPIOSEL_Pos)             /*!< TAMPER_T::FUNEN: TMPIOSEL Mask         */

#define TAMPER_FUNEN_HIRC48MEN_Pos       (16)                                              /*!< TAMPER_T::FUNEN: HIRC48MEN Position    */
#define TAMPER_FUNEN_HIRC48MEN_Msk       (0xfful << TAMPER_FUNEN_HIRC48MEN_Pos)            /*!< TAMPER_T::FUNEN: HIRC48MEN Mask        */

