RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/tamper_reg.h
#define TAMPER_INTEN_BODIEN_Pos          (22)                                              /*!< TAMPER_T::INTEN: BODIEN Position       */
#define TAMPER_INTEN_BODIEN_Msk          (0x1ul << TAMPER_INTEN_BODIEN_Pos)                /*!< TAMPER_T::INTEN: BODIEN Mask           */

#define TAMPER_INTSTS_TAMP0IF_Pos        (0)                                               /*!< TAMPER_T::INTSTS: TAMP0IF Position     */
#define TAMPER_INTSTS_TAMP0IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP0IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP0IF Mask         */

#define TAMPER_INTSTS_TAMP1IF_Pos        (1)                                               /*!< TAMPER_T::INTSTS: TAMP1IF Position     */
#define TAMPER_INTSTS_TAMP1IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP1IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP1IF Mask         */

#define TAMPER_INTSTS_TAMP2IF_Pos        (2)                                               /*!< TAMPER_T::INTSTS: TAMP2IF Position     */
#define TAMPER_INTSTS_TAMP2IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP2IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP2IF Mask         */

#define TAMPER_INTSTS_TAMP3IF_Pos        (3)                                               /*!< TAMPER_T::INTSTS: TAMP3IF Position     */
#define TAMPER_INTSTS_TAMP3IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP3IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP3IF Mask         */

#define TAMPER_INTSTS_TAMP4IF_Pos        (4)                                               /*!< TAMPER_T::INTSTS: TAMP4IF Position     */
#define TAMPER_INTSTS_TAMP4IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP4IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP4IF Mask         */

#define TAMPER_INTSTS_TAMP5IF_Pos        (5)                                               /*!< TAMPER_T::INTSTS: TAMP5IF Position     */
#define TAMPER_INTSTS_TAMP5IF_Msk        (0x1ul << TAMPER_INTSTS_TAMP5IF_Pos)              /*!< TAMPER_T::INTSTS: TAMP5IF Mask         */

#define TAMPER_INTSTS_CLKFAILIF_Pos      (6)                                               /*!< TAMPER_T::INTSTS: CLKFAILIF Position   */
#define TAMPER_INTSTS_CLKFAILIF_Msk      (0x1ul << TAMPER_INTSTS_CLKFAILIF_Pos)            /*!< TAMPER_T::INTSTS: CLKFAILIF Mask       */

#define TAMPER_INTSTS_CLKSTOPIF_Pos      (7)                                               /*!< TAMPER_T::INTSTS: CLKSTOPIF Position   */
#define TAMPER_INTSTS_CLKSTOPIF_Msk      (0x1ul << TAMPER_INTSTS_CLKSTOPIF_Pos)            /*!< TAMPER_T::INTSTS: CLKSTOPIF Mask       */

#define TAMPER_INTSTS_OVPOUTIF_Pos       (8)                                               /*!< TAMPER_T::INTSTS: OVPOUTIF Position    */
#define TAMPER_INTSTS_OVPOUTIF_Msk       (0x1ul << TAMPER_INTSTS_OVPOUTIF_Pos)             /*!< TAMPER_T::INTSTS: OVPOUTIF Mask        */

#define TAMPER_INTSTS_VGPEVIF_Pos        (9)                                               /*!< TAMPER_T::INTSTS: VGPEVIF Position     */
#define TAMPER_INTSTS_VGPEVIF_Msk        (0x1ul << TAMPER_INTSTS_VGPEVIF_Pos)              /*!< TAMPER_T::INTSTS: VGPEVIF Mask         */

#define TAMPER_INTSTS_VGNEVIF_Pos        (10)                                              /*!< TAMPER_T::INTSTS: VGNEVIF Position     */
#define TAMPER_INTSTS_VGNEVIF_Msk        (0x1ul << TAMPER_INTSTS_VGNEVIF_Pos)              /*!< TAMPER_T::INTSTS: VGNEVIF Mask         */

#define TAMPER_INTSTS_ACTSEIF_Pos        (11)                                              /*!< TAMPER_T::INTSTS: ACTSEIF Position     */
#define TAMPER_INTSTS_ACTSEIF_Msk        (0x1ul << TAMPER_INTSTS_ACTSEIF_Pos)              /*!< TAMPER_T::INTSTS: ACTSEIF Mask         */

#define TAMPER_INTSTS_ACTST5IF_Pos       (13)                                              /*!< TAMPER_T::INTSTS: ACTST5IF Position    */
#define TAMPER_INTSTS_ACTST5IF_Msk       (0x1ul << TAMPER_INTSTS_ACTST5IF_Pos)             /*!< TAMPER_T::INTSTS: ACTST5IF Mask        */

#define TAMPER_INTSTS_ACTST25IF_Pos      (15)                                              /*!< TAMPER_T::INTSTS: ACTST25IF Position   */
#define TAMPER_INTSTS_ACTST25IF_Msk      (0x1ul << TAMPER_INTSTS_ACTST25IF_Pos)            /*!< TAMPER_T::INTSTS: ACTST25IF Mask       */

#define TAMPER_INTSTS_RTCLVRIF_Pos       (16)                                              /*!< TAMPER_T::INTSTS: RTCLVRIF Position    */
#define TAMPER_INTSTS_RTCLVRIF_Msk       (0x1ul << TAMPER_INTSTS_RTCLVRIF_Pos)             /*!< TAMPER_T::INTSTS: RTCLVRIF Mask        */

#define TAMPER_INTSTS_RIOTRIGIF_Pos      (17)                                              /*!< TAMPER_T::INTSTS: RIOTRIGIF Position   */
#define TAMPER_INTSTS_RIOTRIGIF_Msk      (0x1ul << TAMPER_INTSTS_RIOTRIGIF_Pos)            /*!< TAMPER_T::INTSTS: RIOTRIGIF Mask       */

#define TAMPER_INTSTS_RCLKTRIGIF_Pos     (18)                                              /*!< TAMPER_T::INTSTS: RCLKTRIGIF Position  */
#define TAMPER_INTSTS_RCLKTRIGIF_Msk     (0x1ul << TAMPER_INTSTS_RCLKTRIGIF_Pos)           /*!< TAMPER_T::INTSTS: RCLKTRIGIF Mask      */

#define TAMPER_INTSTS_BODIF_Pos          (22)                                              /*!< TAMPER_T::INTSTS: BODIF Position       */
#define TAMPER_INTSTS_BODIF_Msk          (0x1ul << TAMPER_INTSTS_BODIF_Pos)                /*!< TAMPER_T::INTSTS: BODIF Mask           */

#define TAMPER_INTSTS_ACTST1IF_Pos       (25)                                              /*!< TAMPER_T::INTSTS: ACTST1IF Position    */
#define TAMPER_INTSTS_ACTST1IF_Msk       (0x1ul << TAMPER_INTSTS_ACTST1IF_Pos)             /*!< TAMPER_T::INTSTS: ACTST1IF Mask        */

#define TAMPER_INTSTS_ACTST3IF_Pos       (27)                                              /*!< TAMPER_T::INTSTS: ACTST3IF Position    */
#define TAMPER_INTSTS_ACTST3IF_Msk       (0x1ul << TAMPER_INTSTS_ACTST3IF_Pos)             /*!< TAMPER_T::INTSTS: ACTST3IF Mask        */

#define TAMPER_INTSTS_ACTST21IF_Pos      (29)                                              /*!< TAMPER_T::INTSTS: ACTST21IF Position   */
#define TAMPER_INTSTS_ACTST21IF_Msk      (0x1ul << TAMPER_INTSTS_ACTST21IF_Pos)            /*!< TAMPER_T::INTSTS: ACTST21IF Mask       */

#define TAMPER_INTSTS_ACTST23IF_Pos      (31)                                              /*!< TAMPER_T::INTSTS: ACTST23IF Position   */
#define TAMPER_INTSTS_ACTST23IF_Msk      (0x1ul << TAMPER_INTSTS_ACTST23IF_Pos)            /*!< TAMPER_T::INTSTS: ACTST23IF Mask       */

