RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/tamper_reg.h
#define TAMPER_LIRCTL_TLRCTRIM_Pos       (0)                                               /*!< TAMPER_T::LIRCTL: TLRCTRIM Position    */
#define TAMPER_LIRCTL_TLRCTRIM_Msk       (0x1fful << TAMPER_LIRCTL_TLRCTRIM_Pos)           /*!< TAMPER_T::LIRCTL: TLRCTRIM Mask        */

#define TAMPER_LIRCTL_TRIMMOS_Pos        (9)                                               /*!< TAMPER_T::LIRCTL: TRIMMOS Position     */
#define TAMPER_LIRCTL_TRIMMOS_Msk        (0x3ul << TAMPER_LIRCTL_TRIMMOS_Pos)              /*!< TAMPER_T::LIRCTL: TRIMMOS Mask         */

#define TAMPER_TIOCTL_DYN1ISS_Pos        (0)                                               /*!< TAMPER_T::TIOCTL: DYN1ISS Position     */
#define TAMPER_TIOCTL_DYN1ISS_Msk        (0x1ul << TAMPER_TIOCTL_DYN1ISS_Pos)              /*!< TAMPER_T::TIOCTL: DYN1ISS Mask         */

#define TAMPER_TIOCTL_DYN2ISS_Pos        (1)                                               /*!< TAMPER_T::TIOCTL: DYN2ISS Position     */
#define TAMPER_TIOCTL_DYN2ISS_Msk        (0x1ul << TAMPER_TIOCTL_DYN2ISS_Pos)              /*!< TAMPER_T::TIOCTL: DYN2ISS Mask         */

#define TAMPER_TIOCTL_DYNSRC_Pos         (3)                                               /*!< TAMPER_T::TIOCTL: DYNSRC Position      */
#define TAMPER_TIOCTL_DYNSRC_Msk         (0x1ul << TAMPER_TIOCTL_DYNSRC_Pos)               /*!< TAMPER_T::TIOCTL: DYNSRC Mask          */

#define TAMPER_TIOCTL_SEEDRLD_Pos        (4)                                               /*!< TAMPER_T::TIOCTL: SEEDRLD Position     */
#define TAMPER_TIOCTL_SEEDRLD_Msk        (0x1ul << TAMPER_TIOCTL_SEEDRLD_Pos)              /*!< TAMPER_T::TIOCTL: SEEDRLD Mask         */

#define TAMPER_TIOCTL_DYNRATE_Pos        (5)                                               /*!< TAMPER_T::TIOCTL: DYNRATE Position     */
#define TAMPER_TIOCTL_DYNRATE_Msk        (0x7ul << TAMPER_TIOCTL_DYNRATE_Pos)              /*!< TAMPER_T::TIOCTL: DYNRATE Mask         */

#define TAMPER_TIOCTL_TAMP0EN_Pos        (8)                                               /*!< TAMPER_T::TIOCTL: TAMP0EN Position     */
#define TAMPER_TIOCTL_TAMP0EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP0EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP0EN Mask         */

#define TAMPER_TIOCTL_TAMP0LV_Pos        (9)                                               /*!< TAMPER_T::TIOCTL: TAMP0LV Position     */
#define TAMPER_TIOCTL_TAMP0LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP0LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP0LV Mask         */

#define TAMPER_TIOCTL_TAMP0DBEN_Pos      (10)                                              /*!< TAMPER_T::TIOCTL: TAMP0DBEN Position   */
#define TAMPER_TIOCTL_TAMP0DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP0DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP0DBEN Mask       */

#define TAMPER_TIOCTL_TAMP1EN_Pos        (12)                                              /*!< TAMPER_T::TIOCTL: TAMP1EN Position     */
#define TAMPER_TIOCTL_TAMP1EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP1EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP1EN Mask         */

#define TAMPER_TIOCTL_TAMP1LV_Pos        (13)                                              /*!< TAMPER_T::TIOCTL: TAMP1LV Position     */
#define TAMPER_TIOCTL_TAMP1LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP1LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP1LV Mask         */

#define TAMPER_TIOCTL_TAMP1DBEN_Pos      (14)                                              /*!< TAMPER_T::TIOCTL: TAMP1DBEN Position   */
#define TAMPER_TIOCTL_TAMP1DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP1DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP1DBEN Mask       */

#define TAMPER_TIOCTL_DYNPR0EN_Pos       (15)                                              /*!< TAMPER_T::TIOCTL: DYNPR0EN Position    */
#define TAMPER_TIOCTL_DYNPR0EN_Msk       (0x1ul << TAMPER_TIOCTL_DYNPR0EN_Pos)             /*!< TAMPER_T::TIOCTL: DYNPR0EN Mask        */

#define TAMPER_TIOCTL_TAMP2EN_Pos        (16)                                              /*!< TAMPER_T::TIOCTL: TAMP2EN Position     */
#define TAMPER_TIOCTL_TAMP2EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP2EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP2EN Mask         */

#define TAMPER_TIOCTL_TAMP2LV_Pos        (17)                                              /*!< TAMPER_T::TIOCTL: TAMP2LV Position     */
#define TAMPER_TIOCTL_TAMP2LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP2LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP2LV Mask         */

#define TAMPER_TIOCTL_TAMP2DBEN_Pos      (18)                                              /*!< TAMPER_T::TIOCTL: TAMP2DBEN Position   */
#define TAMPER_TIOCTL_TAMP2DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP2DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP2DBEN Mask       */

#define TAMPER_TIOCTL_TAMP3EN_Pos        (20)                                              /*!< TAMPER_T::TIOCTL: TAMP3EN Position     */
#define TAMPER_TIOCTL_TAMP3EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP3EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP3EN Mask         */

#define TAMPER_TIOCTL_TAMP3LV_Pos        (21)                                              /*!< TAMPER_T::TIOCTL: TAMP3LV Position     */
#define TAMPER_TIOCTL_TAMP3LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP3LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP3LV Mask         */

#define TAMPER_TIOCTL_TAMP3DBEN_Pos      (22)                                              /*!< TAMPER_T::TIOCTL: TAMP3DBEN Position   */
#define TAMPER_TIOCTL_TAMP3DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP3DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP3DBEN Mask       */

#define TAMPER_TIOCTL_DYNPR1EN_Pos       (23)                                              /*!< TAMPER_T::TIOCTL: DYNPR1EN Position    */
#define TAMPER_TIOCTL_DYNPR1EN_Msk       (0x1ul << TAMPER_TIOCTL_DYNPR1EN_Pos)             /*!< TAMPER_T::TIOCTL: DYNPR1EN Mask        */

#define TAMPER_TIOCTL_TAMP4EN_Pos        (24)                                              /*!< TAMPER_T::TIOCTL: TAMP4EN Position     */
#define TAMPER_TIOCTL_TAMP4EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP4EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP4EN Mask         */

#define TAMPER_TIOCTL_TAMP4LV_Pos        (25)                                              /*!< TAMPER_T::TIOCTL: TAMP4LV Position     */
#define TAMPER_TIOCTL_TAMP4LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP4LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP4LV Mask         */

#define TAMPER_TIOCTL_TAMP4DBEN_Pos      (26)                                              /*!< TAMPER_T::TIOCTL: TAMP4DBEN Position   */
#define TAMPER_TIOCTL_TAMP4DBEN_Msk      (0x1ul << TAMPER_TIOCTL_TAMP4DBEN_Pos)            /*!< TAMPER_T::TIOCTL: TAMP4DBEN Mask       */

#define TAMPER_TIOCTL_TAMP5EN_Pos        (28)                                              /*!< TAMPER_T::TIOCTL: TAMP5EN Position     */
#define TAMPER_TIOCTL_TAMP5EN_Msk        (0x1ul << TAMPER_TIOCTL_TAMP5EN_Pos)              /*!< TAMPER_T::TIOCTL: TAMP5EN Mask         */

#define TAMPER_TIOCTL_TAMP5LV_Pos        (29)                                              /*!< TAMPER_T::TIOCTL: TAMP5LV Position     */
#define TAMPER_TIOCTL_TAMP5LV_Msk        (0x1ul << TAMPER_TIOCTL_TAMP5LV_Pos)              /*!< TAMPER_T::TIOCTL: TAMP5LV Mask         */

