RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/tamper_reg.h
#define TAMPER_LBSTRIM_BSCMPLV_Pos       (8)                                               /*!< TAMPER_T::LBSTRIM: BSCMPLV Position    */
#define TAMPER_LBSTRIM_BSCMPLV_Msk       (0x3ul << TAMPER_LBSTRIM_BSCMPLV_Pos)             /*!< TAMPER_T::LBSTRIM: BSCMPLV Mask        */

#define TAMPER_LBSTRIM_BSCMPOV_Pos       (10)                                              /*!< TAMPER_T::LBSTRIM: BSCMPOV Position    */
#define TAMPER_LBSTRIM_BSCMPOV_Msk       (0x3ul << TAMPER_LBSTRIM_BSCMPOV_Pos)             /*!< TAMPER_T::LBSTRIM: BSCMPOV Mask        */

#define TAMPER_LBSTRIM_HYSCMPLV_Pos      (12)                                              /*!< TAMPER_T::LBSTRIM: HYSCMPLV Position   */
#define TAMPER_LBSTRIM_HYSCMPLV_Msk      (0x3ul << TAMPER_LBSTRIM_HYSCMPLV_Pos)            /*!< TAMPER_T::LBSTRIM: HYSCMPLV Mask       */

#define TAMPER_LBSTRIM_HYSCMPOV_Pos      (14)                                              /*!< TAMPER_T::LBSTRIM: HYSCMPOV Position   */
#define TAMPER_LBSTRIM_HYSCMPOV_Msk      (0x3ul << TAMPER_LBSTRIM_HYSCMPOV_Pos)            /*!< TAMPER_T::LBSTRIM: HYSCMPOV Mask       */

#define TAMPER_VG2_PCLKSEL2_Pos          (0)                                               /*!< TAMPER_T::VG2: PCLKSEL2 Position       */
#define TAMPER_VG2_PCLKSEL2_Msk          (0xful << TAMPER_VG2_PCLKSEL2_Pos)                /*!< TAMPER_T::VG2: PCLKSEL2 Mask           */

#define TAMPER_VG2_NCLKSEL2_Pos          (4)                                               /*!< TAMPER_T::VG2: NCLKSEL2 Position       */
#define TAMPER_VG2_NCLKSEL2_Msk          (0xful << TAMPER_VG2_NCLKSEL2_Pos)                /*!< TAMPER_T::VG2: NCLKSEL2 Mask           */

#define TAMPER_VG2_PDATSEL2_Pos          (8)                                               /*!< TAMPER_T::VG2: PDATSEL2 Position       */
#define TAMPER_VG2_PDATSEL2_Msk          (0xful << TAMPER_VG2_PDATSEL2_Pos)                /*!< TAMPER_T::VG2: PDATSEL2 Mask           */

#define TAMPER_VG2_NDATSEL2_Pos          (12)                                              /*!< TAMPER_T::VG2: NDATSEL2 Position       */
#define TAMPER_VG2_NDATSEL2_Msk          (0xful << TAMPER_VG2_NDATSEL2_Pos)                /*!< TAMPER_T::VG2: NDATSEL2 Mask           */

#define TAMPER_VG2_PCLKSEL3_Pos          (16)                                              /*!< TAMPER_T::VG2: PCLKSEL3 Position       */
#define TAMPER_VG2_PCLKSEL3_Msk          (0xful << TAMPER_VG2_PCLKSEL3_Pos)                /*!< TAMPER_T::VG2: PCLKSEL3 Mask           */

#define TAMPER_VG2_NCLKSEL3_Pos          (20)                                              /*!< TAMPER_T::VG2: NCLKSEL3 Position       */
#define TAMPER_VG2_NCLKSEL3_Msk          (0xful << TAMPER_VG2_NCLKSEL3_Pos)                /*!< TAMPER_T::VG2: NCLKSEL3 Mask           */

#define TAMPER_VG2_PDATSEL3_Pos          (24)                                              /*!< TAMPER_T::VG2: PDATSEL3 Position       */
#define TAMPER_VG2_PDATSEL3_Msk          (0xful << TAMPER_VG2_PDATSEL3_Pos)                /*!< TAMPER_T::VG2: PDATSEL3 Mask           */

#define TAMPER_VG2_NDATSEL3_Pos          (28)                                              /*!< TAMPER_T::VG2: NDATSEL3 Position       */
#define TAMPER_VG2_NDATSEL3_Msk          (0xful << TAMPER_VG2_NDATSEL3_Pos)                /*!< TAMPER_T::VG2: NDATSEL3 Mask           */

/**@}*/ /* TAMPER_CONST */
/**@}*/ /* end of TAMPER register group */
/**@}*/ /* end of REGISTER group */

#endif /* __TAMPER_REG_H__ */
